#include <stdio.h>

//1027.电子钟
/*题目描述
电子钟用四个数字来表示时间，每个数字的尺寸为3*3，用于表示数字的字符包括‘|’、‘_’和空格。
现在给你当前的时间，请你告诉我们电子钟是如何展示这个时间的。

电子钟显示的数字样式如下：

    _  _     _  _  _  _  _  _
  | _| _||_||_ |_   ||_||_|| |
  ||_  _|  | _||_|  ||_| _||_|
输入
输入包含多组测试数据。每组输入包含4个整数，表示当前时间。
输出
对于每组输入，输出由电子钟显示出来的时间样式。
样例输入
1 2 5 6
2 3 4 2
样例输出
    _  _  _
  | _||_ |_
  ||_  _||_|
 _  _     _
 _| _||_| _|
|_  _|  ||_ */

int main(){
    int a[4];
    char c[4][15]={' '};
    while(scanf("%d %d %d %d",a,a+1,a+2,a+3)!=EOF){
        for(int i=0;i<4;i++){
            //第一行
            if(a[i]==1||a[i]==4) c[1][(i*3)+1]=' ';
            else c[1][(i*3)+1]='_';
            //第二行第一列
            if(a[i]==1||a[i]==2||a[i]==3||a[i]==7) c[2][i*3]=' ';
            else c[2][i*3]='|';
            //第二行第二列
            if(a[i]==1||a[i]==7||a[i]==0) c[2][(i*3)+1]=' ';
            else c[2][(i*3)+1]='_';
            //第二行第三列
            if(a[i]==5||a[i]==6) c[2][(i*3)+2]=' ';
            else c[2][(i*3)+2]='|';
            //第三行第一列
            if(a[i]==2||a[i]==6||a[i]==8||a[i]==0) c[3][i*3]='|';
            else c[3][i*3]=' ';
            //第三行第二列
            if(a[i]==1||a[i]==4||a[i]==7) c[3][(i*3)+1]=' ';
            else c[3][(i*3)+1]='_';
            //第三行第三列
            if(a[i]==2) c[3][(i*3)+2]=' ';
            else c[3][(i*3)+2]='|';
        }
        for(int i=1;i<=3;i++){
            for(int j=0;j<12;j++){
                printf("%c",c[i][j]);
            }
            printf("\n");
        }
    }
    return 0;
}
